apache/nuttx/arch/renesas/src/rx65n/rx65n_rtc.c
static uint32_t rtc_dec2bcd(uint8_t value)
{
  return (uint8_t) ((((value / 10) << 4) & 0xf0) | (value % 10));
}

/****************************************************************************
 * Name: rtc_bcd2dec
 *
 * Description:
 *   Convert from 2 digit BCD to decimal.
 *
 * Input Parameters:
 *   value - The BCD value to be converted.
 *
 * Returned Value:
 *   The value in binary representation
 *
 ****************************************************************************/

#if defined (CONFIG_RTC_HIRES) || defined (CONFIG_RTC_ALARM) || defined (CONFIG_RTC_DATETIME)
static int rtc_bcd2dec(uint32_t value)
{
  return (int) ((((value & 0xf0) >> 4) * 10) + (value & 0x0f));
}
#endif

/****************************************************************************
 * Name: rtc_interrupt
 *
 * Description:
 *    RTC interrupt service routine
 *
 * Input Parameters:
 *   irq - The IRQ number that generated the interrupt
 *   context - Architecture specific register save information.
 *
 * Returned Value:
 *   Zero (OK) on success; A negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
static int rtc_alm_interrupt(int irq, void *context, void *arg)
{
  struct alm_cbinfo_s *cbinfo;
  alm_callback_t cb;
  uint8_t source = rx65n_getreg(RX65N_RTC_RCR1);
  if ((source & RTC_ALARM_INT_ENABLE) != 0)
    {
      /* Alarm callback */

      cbinfo = &g_alarmcb;
      cb = cbinfo->ac_cb;
      arg = (void *)cbinfo->ac_arg;
      cbinfo->ac_cb  = NULL;
      cbinfo->ac_arg = NULL;
      cb(arg, 0);
    }

  up_disable_irq(RX65N_ALM_IRQ);
  return 0;
}
#endif

#ifdef CONFIG_RTC_PERIODIC
static int rtc_periodic_interrupt(int irq, void *context, void *arg)
{
  struct prd_cbinfo_s *cbinfo;
  periodiccb_t cb;
  uint8_t source = rx65n_getreg(RX65N_RTC_RCR1);
  if ((source & RTC_PERIOD_INT_ENABLE) != 0)
    {
      /* Periodic callback */

      cbinfo = &g_periodiccb;
      cb = cbinfo->prd_cb;
      arg = (void *)cbinfo->prd_arg;
      cb(arg, 0);
    }

  return 0;
}
#endif

#ifdef CONFIG_RX65N_CARRY
static int rtc_carry_interrupt(int irq, void *context, void *arg)
{
  uint8_t source = rx65n_getreg(RX65N_RTC_RCR1);
  if ((source & RTC_CARRY_INT_ENABLE) != 0)
    {
      /* Carry callback */

      g_carrycb();
    }

  return 0;
}

#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_rtc_initialize
 *
 * Description:
 *   Initialize the hardware RTC per the selected configuration.
 *   This function is
 *   called once during the OS initialization sequence
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int up_rtc_initialize(void)
{
  uint8_t regval;
  uint32_t temp_byte;
  rtc_dumpregs("On reset");

  /* Disable ALM, PRD and CUP interrupts */

  up_disable_irq(RX65N_ALM_IRQ);
  up_disable_irq(RX65N_PRD_IRQ);
  up_disable_irq(RX65N_INTB176_IRQ);

  /* Set RTC clock source as sub clock */

  regval = getreg8(RX65N_RTC_RCR4);
  regval |= RTC_RCR4_RCKSEL;
  rx65n_putreg(regval, RX65N_RTC_RCR4);

  /* Set sub-clock oscillator */

  regval = getreg8(RX65N_RTC_RCR3);
  regval |= RTC_RCR3_RTCEN;
  rx65n_putreg(regval, RX65N_RTC_RCR3);

  while (1U != RTC.RCR3.BIT.RTCEN)
    {
      /* waiting for sub-clock oscillator is operating */
    }

  /* Stop all counters */

  rx65n_putreg(0, RX65N_RTC_RCR2);
  while (0U != RTC.RCR2.BIT.START)
    {
      /* Ensure the clock is stopped while configuring it. */
    }

  /* Select count mode */

  regval = getreg8(RX65N_RTC_RCR2);
  regval |= RTC_RCR2_CNTMD;
  rx65n_putreg(regval, RX65N_RTC_RCR2);

  while (0U != RTC.RCR2.BIT.CNTMD)
    {
      /* Wait for the calendar count mode complete setting */
    }

  /* Execute RTC software reset */

  regval = getreg8(RX65N_RTC_RCR2);
  regval |= RTC_RCR2_RESET;
  rx65n_putreg(regval, RX65N_RTC_RCR2);

  while (0U != RTC.RCR2.BIT.RESET)
    {
      /* Wait for the reset to complete */
    }

  /* Stop RTC counter */

  regval = getreg8(RX65N_RTC_RCR2);
  regval &= ~(RTC_RCR2_START);
  rx65n_putreg(regval, RX65N_RTC_RCR2);

  while (0U != RTC.RCR2.BIT.START)
    {
      /* Ensure the clock is stopped while configuring it. */
    }

  /* Clear ALM,PRD,CUP IR */

  IR(RTC, ALM) = 0U;
  IR(RTC, PRD) = 0U;
  IR(PERIB, INTB176) = 0U;

  /* After a reset is generated, write to the RTC register
   * when six cycles of the count source have elapsed
   */

  up_udelay(RX65N_RTC_WAIT_PERIOD);

  /* Start the counter and set 24hr mode */

  regval = getreg8(RX65N_RTC_RCR2);
  regval |= (RTC_RCR2_HR24);
  rx65n_putreg(regval, RX65N_RTC_RCR2);

  /* Setting RADJ register */

  regval = getreg8(RX65N_RTC_RADJ);
  regval |= (RTC_RADJ_INITVALUE);
  rx65n_putreg(regval, RX65N_RTC_RADJ);

  /* Setting AADJE and AADJP register */

  regval = getreg8(RX65N_RTC_RCR2);
  regval |= (RTC_RCR2_AADJE | RTC_RCR2_AADJP);
  rx65n_putreg(regval, RX65N_RTC_RCR2);
  g_rtc_enabled = true;
  UNUSED(temp_byte);
  return OK;
}

/****************************************************************************
 * Name: up_rtc_gettime
 *
 * Description:
 *   Get the current date and time from the date/time RTC.
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#if defined(CONFIG_RTC_HIRES)
int up_rtc_gettime(struct timespec *tp)
{
  irqstate_t flags;
  uint8_t weekcnt;
  uint8_t daycnt;
  uint8_t monthcnt;
  uint8_t yearcnt;
  uint8_t seccnt;
  uint8_t mincnt;
  uint8_t hrcnt;
  uint8_t tmp_week;
  uint8_t tmp_day;
  uint8_t tmp_month;
  uint8_t tmp_year;
  uint16_t bcd_years;
  uint8_t regval;
  struct tm t;

  flags = spin_lock_irqsave(&g_rtc_lock);
  sched_lock();

