apache/nuttx/arch/renesas/src/rx65n/rx65n_rtc.c
  /* Set the date */

  /* Day of the week (0-6, 0=Sunday) */

  RTC.RWKCNT.BYTE = rtc_dec2bcd((uint8_t) newtime.tm_wday);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RWKCNT.BYTE;
    }

  /* Day of the month (1-31) */

  RTC.RDAYCNT.BYTE = rtc_dec2bcd((uint8_t) newtime.tm_mday);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RDAYCNT.BYTE;
    }

  /* Month. (1-12, 1=January) */

  RTC.RMONCNT.BYTE = rtc_dec2bcd((uint8_t) (newtime.tm_mon + 1));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RMONCNT.BYTE;
    }

  /* Year. (00-99) */

  RTC.RYRCNT.WORD = (uint16_t) (rtc_dec2bcd((uint8_t)
                               ((newtime.tm_year + 1900) % 100)));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_word = RTC.RYRCNT.WORD;
    }

  RTC.RCR2.BIT.START = 1U;

  rtc_dumpregs("New time setting");
  UNUSED(dummy_word);
  UNUSED(dummy_byte);
  return OK;
}

/****************************************************************************
 * Name: rx65n_rtc_getalarmdatetime
 *
 * Description:
 *   Get the current date and time for a RTC alarm.
 *
 * Input Parameters:
 *   reg - RTC alarm register
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
static int rx65n_rtc_getalarmdatetime(struct tm *tp)
{
  uint8_t bcd_years;
  DEBUGASSERT(tp != NULL);

  tp->tm_sec  = rtc_bcd2dec((uint8_t) (RTC.RSECAR.BYTE & 0x7fu));
  tp->tm_min  = rtc_bcd2dec((uint8_t) (RTC.RMINAR.BYTE & 0x7fu));
  tp->tm_hour = rtc_bcd2dec((uint8_t) (RTC.RHRAR.BYTE & 0x3fu));
  tp->tm_mday = rtc_bcd2dec(RTC.RDAYAR.BYTE & 0x3fu);
  tp->tm_mon  = rtc_bcd2dec(RTC.RMONAR.BYTE & 0x1fu) - 1;

  /* Years since 2000 */

  bcd_years = (uint8_t) RTC.RYRAR.WORD;

  tp->tm_year = rtc_bcd2dec((uint8_t) (bcd_years & 0xff)) + 100;
  return 0;
}

#endif
/****************************************************************************
 * Name: rx65n_rtc_rdalarm
 *
 * Description:
 *   Query an alarm configured in hardware.
 *
 * Input Parameters:
 *  alminfo - Information about the alarm configuration.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
int rx65n_rtc_rdalarm(struct alm_rdalarm_s *alminfo)
{
  int ret = -EINVAL;
  DEBUGASSERT(alminfo != NULL);
  ret = rx65n_rtc_getalarmdatetime((struct tm *)alminfo->ar_time);
  return ret;
}
#endif

/****************************************************************************
 * Name: rx65n_rtc_setalarm
 *
 * Description:
 *   Set up an alarm.
 *
 * Input Parameters:
 *   tp - the time to set the alarm
 *   callback - the function to call when the alarm expires.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
int rx65n_rtc_setalarm(struct alm_setalarm_s *alminfo)
{
  irqstate_t flags;
  uint8_t dummy_byte;
  uint8_t dummy_word;
  uint8_t i;

  /* Is there already something waiting on the ALARM? */

  flags = spin_lock_irqsave(&g_rtc_lock);
  sched_lock();

  /* Save the callback info */

  g_alarmcb.ac_cb  = alminfo->as_cb;
  g_alarmcb.ac_arg = alminfo->as_arg;

  IEN(RTC, ALM) = 0U;

  /* Attach the Alarm Interrupt */

  irq_attach(RX65N_ALM_IRQ, rtc_alm_interrupt, NULL);

  /* Start RTC counter */

  RTC.RCR2.BIT.START = 1U;
  while (1U != RTC.RCR2.BIT.START)
    {
      /* Wait for the register modification to complete */
    }

  /* Set time */

  /* Set seconds. (0-59) */

  RTC.RSECAR.BYTE |= 0x80u;

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = RTC.RSECAR.BYTE;
    }

  RTC.RSECAR.BYTE |=  rtc_dec2bcd((uint8_t)alminfo->as_time.tm_sec);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RSECAR.BYTE;
    }

  /* Set minutes (0-59) */

  RTC.RMINAR.BYTE |= 0x80u;

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = RTC.RMINAR.BYTE;
    }

  RTC.RMINAR.BYTE |= rtc_dec2bcd((uint8_t) alminfo->as_time.tm_min);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = RTC.RMINAR.BYTE;
    }

  /* Set hours. (0-23) */

  RTC.RHRAR.BYTE |= 0x80u;

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RHRAR.BYTE;
    }

  RTC.RHRAR.BYTE |= rtc_dec2bcd((uint8_t) alminfo->as_time.tm_hour);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RHRAR.BYTE;
    }

  /* Day of the month (1-31) */

  RTC.RDAYAR.BYTE |= 0x80u;

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = RTC.RDAYAR.BYTE;
    }

  RTC.RDAYAR.BYTE |= rtc_dec2bcd((uint8_t) alminfo->as_time.tm_mday);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = RTC.RDAYAR.BYTE;
    }

  /* Month. (1-12, 1=January) */

  RTC.RMONAR.BYTE |= 0x80u;

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RMONAR.BYTE;
    }

  RTC.RMONAR.BYTE |= rtc_dec2bcd((uint8_t) ((alminfo->as_time.tm_mon)+ 1));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = RTC.RMONAR.BYTE;
    }

  /* Year. (00-99) */

  RTC.RYRAR.WORD = (uint16_t) (rtc_dec2bcd((uint8_t)
                   ((alminfo->as_time.tm_year) + 1900)));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_word = RTC.RYRAR.WORD;
    }

  rtc_dumpregs("New alarm setting");

  /* Enable RTC ALARM interrupt */

  RTC.RCR1.BIT.AIE = 1U;

  /* Clear IR flag of ICU ALARM interrupt */

  IR(RTC, ALM) = 0U;

  /* Enable alarm interrupts */

  IEN(RTC, ALM) = 1U;

