apache/nuttx/arch/renesas/src/rx65n/rx65n_rtc.c
  /* Set Priority of ALM interrupt */

  IPR(RTC, ALM) = _0F_RTC_PRIORITY_LEVEL15;
  spin_unlock_irqrestore(&g_rtc_lock, flags);
  sched_unlock();
  UNUSED(dummy_byte);
  UNUSED(dummy_word);
  return OK;
}
#endif

#ifdef CONFIG_RTC_PERIODIC
int rx65n_rtc_setperiodic(const struct timespec *period,
                          periodiccb_t callback)
{
  irqstate_t flags;
  volatile uint8_t regval;
  uint8_t prd;
  flags = spin_lock_irqsave(&g_rtc_lock);

  /* No.. Save the callback function pointer */

  g_periodiccb.prd_cb = callback;
  prd = period->tv_sec;

  /* Disable ICU PRD interrupt */

  IEN(RTC, PRD) = 0U;

  /* Clear IR flag of PRD interrupt */

  IR(RTC, PRD) = 0U;

  /* Set RTC control register 1 */

  regval = getreg8(RX65N_RTC_RCR1);
  regval |= 0x04 | (prd << 4);
  rx65n_putreg(regval, RX65N_RTC_RCR1);

  irq_attach(RX65N_PRD_IRQ, rtc_periodic_interrupt, NULL);

  /* Start RTC counter */

  RTC.RCR2.BIT.START = 1U;

  /* Enable ICU PRD interrupt */

  IEN(RTC, PRD) = 1U;

  /* Set PRD priority level */

  IPR(RTC, PRD) = _0F_RTC_PRIORITY_LEVEL15;
  spin_unlock_irqrestore(&g_rtc_lock, flags);
  return OK;
}
#endif

#ifdef CONFIG_RX65N_CARRY
void rx65n_rtc_set_carry(carrycb_t callback)
{
  irqstate_t flags;
  flags = spin_lock_irqsave(&g_rtc_lock);

  /* No.. Save the callback function pointer */

  g_carrycb = callback;

  /* Clear IR flag of CUP interrupt */

  IR(PERIB, INTB176) = 0U;
  irq_attach(RX65N_INTB176_IRQ, rtc_carry_interrupt, NULL);

  RTC.RCR2.BIT.START = 1U;

  /* Enable ICU CUP interrupt */

  IEN(PERIB, INTB176) = 1U;

  /* Set CUP priority level */

  ICU.SLIBR176.BYTE = 0x31u;
  IPR(PERIB, INTB176) = 15;
  RTC.RCR1.BIT.CIE = 1U;

  spin_unlock_irqrestore(&g_rtc_lock, flags);
}

#endif
#ifdef CONFIG_RTC_ALARM
int rx65n_rtc_cancelalarm(void)
{
  irqstate_t flags;
  int ret = -ENODATA;

  flags = spin_lock_irqsave(&g_rtc_lock);

  /* Cancel the global callback function */

  g_alarmcb.ac_cb = NULL;
  g_alarmcb.ac_arg = NULL;

  /* Unset the alarm */

  rx65n_putreg(0x0, RX65N_RTC_RSECAR);
  rx65n_putreg(0x0, RX65N_RTC_RMINAR);
  rx65n_putreg(0x0, RX65N_RTC_RHRAR);
  rx65n_putreg(0x0, RX65N_RTC_RWKAR);
  rx65n_putreg(0x0, RX65N_RTC_RDAYAR);
  rx65n_putreg(0x0, RX65N_RTC_RMONAR);
  rx65n_putreg(0x0, RX65N_RTC_RYRAR);
  ret = OK;

  spin_unlock_irqrestore(&g_rtc_lock, flags);

  return ret;
}

#endif

#ifdef CONFIG_RTC_PERIODIC
int rx65n_rtc_cancelperiodic(void)
{
  /* Disable ICU PRD interrupt */

  IEN(RTC, PRD) = 0U;

  /* Clear IR flag of PRD interrupt */

  IR(RTC, PRD) = 0U;

  /* Disable RTC PRD interrupt */

  RTC.RCR1.BIT.PIE = 0U;
  while (0U != RTC.RCR1.BIT.PIE)
    {
      /* Wait for this write to complete. */
    }

  return OK;
}

#endif

#if defined(CONFIG_RX65N_CARRY)

int rx65n_rtc_cancelcarry(void)
{
  /* Clear IR flag of CUP interrupt */

  IR(PERIB, INTB176) = 0U;

  /* Disable ICU CUP interrupt */

  IEN(PERIB, INTB176) = 0U;

  /* Disable RTC CUP interrupt */

  RTC.RCR1.BIT.CIE = 0U;
  return OK;
}

#endif
/****************************************************************************
 * Name: up_rtc_getdatetime
 *
 * Description:
 *   Get the current date and time from the date/time RTC.  This interface
 *   is only supported by the date/time RTC hardware implementation.
 *   It is used to replace the system timer.  It is only used
 *   by the RTOS during initialization to set up the system time
 *   when CONFIG_RTC  and CONFIG_RTC_DATETIME
 *   are selected (and CONFIG_RTC_HIRES is not).
 *
 *   NOTE: Some date/time RTC hardware is capability of sub-second accuracy.
 *   That sub-second accuracy is lost in this interface.  However,
 *   since the system time is reinitialized on each power-up/reset,
 *   there will be no timing inaccuracy in the long run.
 *
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_DATETIME
int up_rtc_getdatetime(struct tm *tp)
{
  uint8_t weekcnt;
  uint8_t daycnt;
  uint8_t monthcnt;
  uint8_t yearcnt;
  uint8_t seccnt;
  uint8_t mincnt;
  uint8_t hrcnt;
  uint8_t tmp_week;
  uint8_t tmp_day;
  uint8_t tmp_month;
  uint8_t tmp_year;
  uint16_t bcd_years;
  uint8_t regval;

  /* Sample the data time registers.  There is a race condition here...
   * If we sample the time just before midnight on December 31,
   * the date could be wrong because the day rolled over while were sampling.
   */

  if (RTC.RCR2.BIT.START == 0)
    {
          RTC.RCR2.BIT.START = 1;
    }

  do
    {
      weekcnt  = getreg8(RX65N_RTC_RWKCNT);
      daycnt   = getreg8(RX65N_RTC_RDAYCNT);
      monthcnt = getreg8(RX65N_RTC_RMONCNT);
      yearcnt  = getreg8(RX65N_RTC_RYRCNT);
      seccnt   = getreg8(RX65N_RTC_RSECCNT);
      mincnt   = getreg8(RX65N_RTC_RMINCNT);
      hrcnt    = getreg8(RX65N_RTC_RHRCNT);
      tmp_week = getreg8(RX65N_RTC_RWKCNT);
      tmp_day  = getreg8(RX65N_RTC_RDAYCNT);
      tmp_month = getreg8(RX65N_RTC_RMONCNT);
      tmp_year  = getreg8(RX65N_RTC_RYRCNT);
    }

  while (tmp_week != weekcnt && tmp_day != daycnt &&
         tmp_month != monthcnt && tmp_year != yearcnt);

  rtc_dumpregs("Reading Time");

  /* Convert the RTC time register fields to struct tm format.
   *
   *   struct tm       TIMR register
   *   tm_sec    0-61* SEC    (0-59)
   *   tm_min    0-59  MIN    (0-59)
   *   tm_hour   0-23  HOUR   (0-23)
   *
   *  *To allow for leap seconds.  But these never actuall happen.
   */

  /* Disable ICU CUP interrupt */

  up_disable_irq(CONFIG_RX65N_PERIB);

  /* Enable RTC CUP interrupt */

  regval = getreg8(RX65N_RTC_RCR1);
  regval |= (RTC_RCR1_CUP);
  rx65n_putreg(regval, RX65N_RTC_RCR1);

  do
    {
      /* Clear carry flag in ICU */

      IR(PERIB, INTB176) = 0U;

      /* Read and convert RTC registers;
       * mask off unknown bits and hour am/pm.
       */

      /* Seconds. (0-59) */

      tp->tm_sec = rtc_bcd2dec((uint8_t) (RTC.RSECCNT.BYTE & 0x7fu));

      /* Minutes. (0-59) */

      tp->tm_min = rtc_bcd2dec((uint8_t) (RTC.RMINCNT.BYTE & 0x7fu));

      /* Hours. (0-23) */

      tp->tm_hour = rtc_bcd2dec((uint8_t) (RTC.RHRCNT.BYTE & 0x3fu));

      /* Day of the month (1-31) */

      tp->tm_mday = rtc_bcd2dec(RTC.RDAYCNT.BYTE);

      /* Months since January (0-11) */

      tp->tm_mon =  rtc_bcd2dec(RTC.RMONCNT.BYTE) - 1;

      /* Years since 2000 */

      bcd_years = (uint16_t) RTC.RYRCNT.WORD;

      /* years years since 1900 (100-199) */

      tp->tm_year = rtc_bcd2dec((uint8_t) (bcd_years & 0xff)) + 100;

      /* Days since Sunday (0-6) */

      tp->tm_wday = (int) (RTC.RWKCNT.BYTE & 0x07u);
      rtc_dumptime(tp, "Returning");
    }

  while (1 == IR(PERIB, INTB176));
  UNUSED(hrcnt);
  UNUSED(mincnt);
  UNUSED(seccnt);
  return OK;
}

#endif
#endif /* CONFIG_RX65N_RTC */
